<!-- placeholder-1 -->
```fish
terraform plan -chdir=./terraform
```
<!-- placeholder-2 -->

<details open><summary>Diff of 2 changes.</summary>

```diff
! module.secrets_manager.aws_secretsmanager_secret_version.this[0] must be replaced
- module.secrets_manager.random_password.this[0] will be destroyed
# (because random_password.this is not in configuration)
```
</details>
<!-- placeholder-3 -->
<details><summary>Plan: 1 to add, 0 to change, 2 to destroy.</br>

<!-- placeholder-4 -->
###### By @wesleykirkland at 2026-02-28T21:44:19Z [(view log)](https://github.com/wesleykirkland/wesleyk.me/actions/runs/22529660879/job/65267083592#step:12:1).
</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.secrets_manager.aws_secretsmanager_secret_version.this[0] must be replaced
-/+ resource "aws_secretsmanager_secret_version" "this" {
      ~ arn                      = "arn:aws:secretsmanager:us-east-2:838419074361:secret:website-wesleyk-me-izB02K" -> (known after apply)
      + has_secret_string_wo     = (known after apply)
      ~ id                       = "arn:aws:secretsmanager:us-east-2:838419074361:secret:website-wesleyk-me-izB02K|terraform-20250627013626463700000002" -> (known after apply)
      - secret_string            = (sensitive value) -> null # forces replacement
      + secret_string_wo_version = 0 # forces replacement
      ~ version_id               = "terraform-20250627013626463700000002" -> (known after apply)
      ~ version_stages           = [] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.secrets_manager.random_password.this[0] will be destroyed
  # (because random_password.this is not in configuration)
  - resource "random_password" "this" {
      - bcrypt_hash      = (sensitive value) -> null
      - id               = "none" -> null
      - length           = 64 -> null
      - lower            = true -> null
      - min_lower        = 0 -> null
      - min_numeric      = 0 -> null
      - min_special      = 0 -> null
      - min_upper        = 0 -> null
      - number           = true -> null
      - numeric          = true -> null
      - override_special = "!@#$%^&*()_+" -> null
      - result           = (sensitive value) -> null
      - special          = true -> null
      - upper            = true -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-70-670af416b2898eab5214216f22fc20b0.tfplan -->
<!-- placeholder-6 -->